{
  "locations": [
    {
      "id": 1,
      "name": "Campus One Dorm room",
      "brief_description": "TBA",
      "long_description": "You wake up in your dorm room, which is in complete disarray. However, your anxiety at this moment surpasses the mess. You know you need to find your laptop charger, the USB drive that stores all your project code, and your water bottle before the deadline hits. To the west is your desk, to the south is your bed, and to the east is your dorm door. Beyond that door, you'll reach the 15th floor of Campus One.",
      "available_commands": {
      "go south": 2,
      "go west": 3,
      "go east": 4
      },
      "items": []
    },
    {
      "id": 2,
      "name": "Dorm room Bed",
      "brief_description": "Your bed is messy. Type “go north” to return to your room.",
      "long_description": "Your bed is a total mess, and you have no idea if something might be hidden underneath the blanket. Type “go north” to return to your room.",
      "available_commands": {
        "go north": 1
      },
      "items": []
    },
    {
      "id": 3,
      "name": "Dorm room Desk",
      "brief_description": "Your desk is very cluttered, your dorm door is to the east",
      "long_description": "Your desk is very cluttered, but you can still spot your T-card, the CS111 syllabus, and a mouse on it. Type \"pick *\" the name of an item to pick it up. Your dorm door is to the east.",
      "available_commands": {
        "go east": 1,
        "pick T-card": 100,
        "pick CSC111 syllabus": 100
      },
      "items": []
    },
    {
      "id": 4,
      "name": "Campus One 15th floor",
      "brief_description": "TBA",
      "long_description": "You are on the 15th floor of Campus One. To the north is the elevator, to the east is the study room, and to the west is your dorm room.",
      "available_commands": {
        "go west": 1,
        "go east": 5,
        "go north": 6
      },
      "items": []
    },
    {
      "id": 5,
      "name": "Campus One Study Room",
      "brief_description": "You don't recall ever being in this study room before. The exit is to the west.",
      "long_description": "You don't recall ever being in this study room before. The exit is to the west.",
      "available_commands": {
        "go west": 4
      },
      "items": []
    },
    {
      "id": 6,
      "name": "Campus One Elevator",
      "brief_description": "Welcome aboard the Campus One elevator. There are many buttons inside. You know that \"1\" takes you to the lobby, and \"15\" is the floor where your room is located. Type \"1\" or \"15\" to go to the corresponding floor.",
      "long_description": "Welcome aboard the Campus One elevator. There are many buttons inside. You know that \"1\" takes you to the lobby, and \"15\" is the floor where your room is located. Type \"1\" or \"15\" to go to the corresponding floor.",
      "available_commands": {
        "15": 4,
        "1": 7
      },
      "items": []
    },
    {
      "id": 7,
      "name": "Campus One Lobby",
      "brief_description": "This is the Campus One lobby. You can head south to reach the elevator that takes you to your dorm room.",
      "long_description": "This is the Campus One lobby. You can head south to reach the elevator that takes you to your dorm room.",
      "available_commands": {
        "go south": 6,
        "go north": 8
      },
      "items": []
    },
    {
      "id": 8,
      "name": "Walk Way",
      "brief_description": "This is St. George Street. Heading north takes you to RB, south to Campus One, west to BA, and east to MS.",
      "long_description": "This is St. George Street, where many University of Toronto buildings line both sides of the road. Heading north, you'll reach the Roberts Library, a place you frequently study at. Heading south takes you to your dorm, Campus One. Going west leads to the Bahen Centre, the hub for the computer science department. To the east is the Medical Sciences Building, where you often grab food and where a Starbucks is located.",
      "available_commands": {
        "go north": 15,
        "go south": 7,
        "go west": 21,
        "go east": 9
      },
      "items": []
    },
    {
      "id": 9,
      "name": "MS Lobby",
      "brief_description": "This is the MS lobby. You can head east to reach Starbucks or west to return to St. George Street.",
      "long_description": "This is the MS lobby. You can head east to reach Starbucks or west to return to St. George Street.",
      "available_commands": {
        "go west": 8,
        "go east": 10
      },
      "items": []
    },{
      "id": 10,
      "name": "MS Starbucks",
      "brief_description": "This is the Starbucks in MS, but it is already closed. You can head west to return to the MS lobby or east to enter the dining hall.",
      "long_description": "This is the Starbucks in MS. As an environmentally conscious person, you love using your own cup when ordering here. Feeling a bit drowsy, you had planned to get another coffee, but the Starbucks has already closed for the day. You can head west to return to the MS lobby or east to enter the dining hall.",
      "available_commands": {
        "go west": 9,
        "go east": 11
      },
      "items": []
    },
    {
      "id": 11,
      "name": "MS Dining Hall",
      "brief_description": "Due to limited seating, the MS dining hall only allows students with food or drinks to enter. Carrying the coffee you bought from RB Starbucks, you gain access without any issues. There are three tables here—one to the north, one to the south, and one to the east. You can head west to return to the MS Starbucks.",
      "long_description": "Due to limited seating, the MS dining hall only allows students with food or drinks to enter. Carrying the coffee you bought from RB Starbucks, you gain access without any issues. There are three tables here—one to the north, one to the south, and one to the east. You can head west to return to the MS Starbucks.",
      "available_commands": {
        "go north": 12,
        "go south": 14,
        "go west": 10,
        "go east": 13
      },
      "items": ["coffee"]
    },
    {
      "id": 12,
      "name": "MS Desk1",
      "brief_description": "There's nothing here. Type \"go south\" to return to the dining hall.",
      "long_description": "There's nothing here. Type \"go south\" to return to the dining hall.",
      "available_commands": {
        "go south": 12
      },
      "items": []
    },
    {
      "id": 13,
      "name": "MS Desk2",
      "brief_description": "You found your missing water bottle on this table. Fortunately, no one took it. Type \"pick bottle\" to pick up the water bottle or \"go west\" to return to the dining hall.",
      "long_description": "You found your missing water bottle on this table. Fortunately, no one took it. Type \"pick bottle\" to pick up the water bottle or \"go west\" to return to the dining hall.",
      "available_commands": {
        "go west": 11,
        "pick bottle": 100
      },
      "items": ["bottle"]
    },
    {
      "id": 14,
      "name": "MS Desk3",
      "brief_description": "There's nothing here. Type \"go north\" to return to the dining hall.",
      "long_description": "There's nothing here. Type \"go north\" to return to the dining hall.",
      "available_commands": {
        "go north": 11
      },
      "items": []
    },
    {
      "id": 15,
      "name": "RB Entry",
      "brief_description": "This is the entrance to Roberts Library. You can head north to reach the RB lobby or south to return to St. George Street.",
      "long_description": "This is the entrance to Roberts Library. You can head north to reach the RB lobby or south to return to St. George Street.",
      "available_commands": {
        "go north": 16,
        "go south": 8
      },
      "items": []
    },
    {
      "id": 16,
      "name": "RB Lobby",
      "brief_description": "This is the RB lobby. You can head north to reach the second floor of RB, south back to entry, west to Study Room, or east to Front desk.",
      "long_description": "This is the RB lobby, where books and computers are displayed. You can head north to reach the second floor of RB, south back to entry, west to Study Room, or east to Front desk.",
      "available_commands": {
        "go north": 18,
        "go south": 15,
        "go west": 17,
        "go east": 19
      },
      "items": []
    },
    {
      "id": 17,
      "name": "RB Study Room",
      "brief_description": "You find nothing here. You can head east to return to the RB lobby.",
      "long_description": "This is a place where you often come to study, but you and your teammates avoid holding discussions here since loud talking is not allowed. After searching the area, you find nothing of interest. You can head east to return to the RB lobby.",
      "available_commands": {
        "go east": 16
      },
      "items": []
    },
    {
      "id": 18,
      "name": "RB 2nd Floor",
      "brief_description": "This is the second floor of RB. You can head north to reach Starbucks or south to return to the RB lobby.",
      "long_description": "This is the second floor of RB. You can head north to reach Starbucks or south to return to the RB lobby.",
      "available_commands": {
        "go north": 20,
        "go south": 16
      },
      "items": []
    },
    {
      "id": 19,
      "name": "RB Front Desk",
      "brief_description": "There is a staff member here. You ask if they have found a lost USB drive, but unfortunately, they haven't seen any. You can head west to return to the RB lobby.",
      "long_description": "There is a staff member here. You ask if they have found a lost USB drive, but unfortunately, they haven't seen any. You can head west to return to the RB lobby.",
      "available_commands": {
        "go west": 16
      },
      "items": []
    },
    {
      "id": 20,
      "name": "RB Starbucks",
      "brief_description": "Here is Starbucks at RB. You can type \"pick coffee\" to get a cup of coffee or head south to return to the second floor.",
      "long_description": "This is the Starbucks you visit most often since your meal plan can be used here. You've been walking for a long time and would love to take a break with a cup of coffee, but your deadline is looming. At this moment, a friendly barista asks what you'd like to order. You can type \"pick coffee\" to get a cup of coffee or head south to return to the second floor.",
      "available_commands": {
        "go south": 18,
        "pick coffee": 100
      },
      "items": []
    },
    {
      "id": 21,
      "name": "BA Entry",
      "brief_description": "Welcome to the Bahen Centre, the hub of the computer science department. You can head west to reach the BA lobby or east to return to St. George Street.",
      "long_description": "Welcome to the Bahen Centre, the hub of the computer science department. You can head west to reach the BA lobby or east to return to St. George Street.",
      "available_commands": {
        "go west": 22,
        "go east": 8
      },
      "items": []
    },
    {
      "id": 22,
      "name": "BA Lobby",
      "brief_description": "This is the BA lobby. You can head west to the second floor, south to the Engineering Lounge, or east to return to the BA entrance.",
      "long_description": "This is the BA lobby. As a CS student, being here feels like a fish returning to the sea—familiar and comforting. You and your friends completed your project here, though you can’t quite remember the exact spot. Explore boldly! You can head west to the second floor, south to the Engineering Lounge, or east to return to the BA entrance.",
      "available_commands": {
        "go south": 23,
        "go west": 24,
        "go east": 21
      },
      "items": []
    },
    {
      "id": 23,
      "name": "BA Engineering Lounge",
      "brief_description": "Answer the question or head north to return to the BA lobby.",
      "long_description": "This is the Engineering Lounge. You vaguely recall that this is where you and your friends completed your project, as it was quiet and mostly empty. Unexpectedly, the door is now locked, and since you're not an engineering student, you don't have access to enter. In your quest to find your USB drive, you have no choice but to seek help from a student inside.\n\nKnock, knock. You tap on the door twice. Creak, the door opens, and a student from engineering appears. You quickly ask if they can let you in. He gives you a skeptical look and says, \"Are you really a UofT student? You know, the students who can enter BA are the smartest in computer science, engineering, and math.\"\n\nYou rush to prove yourself. \"I'm a first-year CS student. I might have dropped my USB drive inside. Could you let me go in and grab it?\"\n\nStill doubtful, the engineering student replies, \"I'll test you with a question. If you can solve it, I'll believe you're a UofT student. Here's the question: A king has 1,000 barrels of wine, one of which is poisoned. Anyone who drinks the poisoned wine will die exactly 24 hours later. The king has a banquet the next day, so he only has time to perform one round of testing. What is the minimum number of prisoners required to determine which barrel contains the poison?\"\n\nHe adds, \"Since you say you're a computer science student, here's a hint: the solution is related to binary numbers.\"\n\nAfter a moment of thought, you come up with an answer. (Please enter your answer directly or head north to return to the BA lobby.)",
      "available_commands": {
        "go north": 22,
        "10": 30

      },
      "items": []
    },
    {
      "id": 24,
      "name": "BA 2nd floor",
      "brief_description": "This is the second floor of the Bahen Centre. You can head north to reach Sadia's office, west to enter the CS lab or east to lobby.",
      "long_description": "This is the second floor of the Bahen Centre. You often come here because the computer science department offers free printing for students, and you frequently attend Sadia's office hours for help. You suddenly remember that you had brought your laptop to the CS lab to study, and it seems you might have left your charger there. You can head north to reach Sadia's office, west to enter the CS lab or east to lobby.",
      "available_commands": {
        "go north": 25,
        "go west": 26,
        "go east": 22
      },
      "items": []
    },
    {
      "id": 25,
      "name": "BA Sadia Office",
      "brief_description": "You walk into Sadia's office and pull out the \"CSC111 Syllabus\" you brought from your dorm. You explain to Sadia that you accidentally lost the USB drive containing your project and ask if it's possible to extend the deadline by one more day. Sadia smiles and says, \"What reason do you have for me to grant you an extension?\"\n\nFeeling apologetic, you point to the \"Special consideration for other homework\" section of the syllabus and explain that you just need a little extra time to finish the task. Kind-hearted as always, Sadia agrees to your request.\n\n **Congratulations! You've unlocked the hidden ending: Assignment Extension!**",
      "long_description": "You walk into Sadia's office and pull out the \"CSC111 Syllabus\" you brought from your dorm. You explain to Sadia that you accidentally lost the USB drive containing your project and ask if it's possible to extend the deadline by one more day. Sadia smiles and says, \"What reason do you have for me to grant you an extension?\"\n\nFeeling apologetic, you point to the \"Special consideration for other homework\" section of the syllabus and explain that you just need a little extra time to finish the task. Kind-hearted as always, Sadia agrees to your request.\n\n **Congratulations! You've unlocked the hidden ending: Assignment Extension!**",
      "available_commands": {
        "go south": 24
      },
      "items": ["CSC111 syllabus"]
    },
    {
      "id": 26,
      "name": "BA CS Lab",
      "brief_description": "Type \"pick charger\" to retrieve your charger or head east to return to the second floor of the Bahen Centre.",
      "long_description": "As a computer science student, you successfully use your T-card to enter the CS Lab. Luckily, you find your charger in the lost and found corner! Type \"pick charger\" to retrieve your charger or head east to return to the second floor of the Bahen Centre.",
      "available_commands": {
        "go east": 24,
        "pick charger": 100
      },
      "items": ["T-card"]
    },
    {
      "id": 30,
      "name": "BA Engineering Lounge",
      "brief_description": "Inside, you find your lost USB drive! Type \"pick USB\" to retrieve it or head north to return to the BA lobby.",
      "long_description": "You're smart enough to figure out the solution. You assign each of the 1,000 barrels of wine a binary number: the first barrel is 1, the second is 10, the third is 11, the fourth is 100, the fifth is 101, and so on. Since 2^10 =1024, all 1,000 barrels can be represented using just 10 bits in binary.\n\nThe engineering student is impressed and grants you access to the Engineering Lounge. Inside, you find your lost USB drive! Type \"pick USB\" to retrieve it or head north to return to the BA lobby.",
      "available_commands": {
        "go north": 22,
        "pick USB": 100
      },
      "items": []
    }
  ],
  "items": [
    {
      "name": "T-card",
      "target_points": 5
    },
    {
      "name": "coffee",
      "target_points": 5
    },
    {
      "name": "CSC111 syllabus",
      "target_points": 5
    },
    {
      "name": "USB",
      "target_points": 25
    },
    {
      "name": "charger",
      "target_points": 25
    },
    {
      "name": "bottle",
      "target_points": 25
    }
  ]
}
